# CopingWarningOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColumnInsideWallFailures..::..CopingWarningOffset Property
BuiltInFailures..::..ColumnInsideWallFailures Class See Also
---
Coping applied, but no cut was made. Adjust Coping Distance or Offset parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CopingWarningOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CopingWarningOffset As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CopingWarningOffset {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace